### The excercises:

https://vle.aston.ac.uk/bbcswebdav/courses/2022_CS4780_P1_P2_A/Labs/Lab01_Introduction.html

### Data to download:

https://vle.aston.ac.uk/webapps/cmsmain/webui/courses/2022_CS4780_P1_P2_A/Labs/data?action=frameset&subaction=view&uniq=-j3yb34&course_id=_39400_1&mask=%2Fcourses%2F2022_CS4780_P1_P2_A

# Instructions for installing jupyter Notebook. 

Iprefer to work in the VS code editor so the instructions are for this particular editor.
https://opensourceoptions.com/blog/jupyter-notebooks-in-visual-studio-code/

### Steps before starting work
 - setup virtual envioroment
 - installed necessary packages 
    - Pandas, numpy

In [6]:
import pandas as pd
import numpy
from pathlib import Path

In [11]:
data_folder_path = "/home/gatis/Documents/random/reasearch_methods/labs/data"
cars_data_path = Path(data_folder_path).joinpath("mycars.csv")
cars_data_path

PosixPath('/home/gatis/Documents/random/reasearch_methods/labs/data/mycars.csv')

## Excercise 1

In [14]:
a = 1 # scalar
del(a) # deletes a created varable

a = [5, 4, 1, 3, 7] # list
a[4] # python indices start from 0

7

In [16]:
# Creating a dataframe

# Define a dictionary containing employee data
# Dictionanaries are used if you are creating a dataframe from scratch
data = {'Name':['Jai', 'Princi', 'Gaurav', 'Anuj'],
        'Age':[27, 24, 22, 32],
        'Address':['Delhi', 'Kanpur', 'Allahabad', 'Kannauj'],
        'Qualification':['Msc', 'MA', 'MCA', 'Phd']}

df_employees = pd.DataFrame(data=data)
df_employees.head()

     Name  Age    Address Qualification
0     Jai   27      Delhi           Msc
1  Princi   24     Kanpur            MA
2  Gaurav   22  Allahabad           MCA
3    Anuj   32    Kannauj           Phd

In [17]:
# You can create an empty dataframe and then add data to it

df_employees_empty = pd.DataFrame(columns=["Name", "Age", "Qualificaitons"])
df_employees_empty

Empty DataFrame
Columns: [Name, Age, Qualificaitons]
Index: []

In [18]:
df_employees_empty.loc[0] = ["gatis","28","Research Student"]
df_employees_empty.head()

    Name Age    Qualificaitons
0  gatis  28  Research Student

## Excercise 2

More on dealing with rows and columns in pandas. https://www.geeksforgeeks.org/dealing-with-rows-and-columns-in-pandas-dataframe/

In [21]:
df_mycars_orig = pd.read_csv(cars_data_path) # loads the data from the dataframe

In [22]:
df_mycars = df_mycars_orig.copy(deep=True)

In [23]:
df_mycars.head() # displays a given set of rows for the matrix (dataframe) default of 5 rows.

,make,mpg,cyl,disp,hp,drat,wt,qsec,vs,am,gear,carb
0,Mazda RX4,21.0,6,160.0,110,3.90,2.620,16.46,0,1,4,4
1,Mazda RX4 Wag,21.0,6,160.0,110,3.90,2.875,17.02,0,1,4,4
2,Datsun 710,22.8,4,108.0,93,3.85,2.320,18.61,1,1,4,1
3,Hornet 4 Drive,21.4,6,258.0,110,3.08,3.215,19.44,1,0,3,1
4,Hornet Sportabout,18.7,8,360.0,175,3.15,3.440,17.02,0,0,3,2

In [24]:
# Getting summary statistics on a column of data
df_mycars.mpg.describe()

count    32.000000
mean     20.090625
std       6.026948
min      10.400000
25%      15.425000
50%      19.200000
75%      22.800000
max      33.900000
Name: mpg, dtype: float64

In [28]:
# Calculate liters per 100 KM from gallon per mile 
df_mycars["lp100k"] = 100/((df_mycars.mpg*1.609)/4.546)
df_mycars.head()

,make,mpg,cyl,disp,hp,drat,wt,qsec,vs,am,gear,carb,lp100k
0,Mazda RX4,21.0,6,160.0,110,3.90,2.620,16.46,0,1,4,4,13.454083
1,Mazda RX4 Wag,21.0,6,160.0,110,3.90,2.875,17.02,0,1,4,4,13.454083
2,Datsun 710,22.8,4,108.0,93,3.85,2.320,18.61,1,1,4,1,12.391918
3,Hornet 4 Drive,21.4,6,258.0,110,3.08,3.215,19.44,1,0,3,1,13.202605
4,Hornet Sportabout,18.7,8,360.0,175,3.15,3.440,17.02,0,0,3,2,15.108863

In [29]:
# remove a column or row from a dataframe
# where 1 is the axis number (0 for rows and 1 for columns.)

# df_mycars = df_mycars.drop("lp100k",axis=1)

# To delete the column without having to reassign df you can do:

df_mycars.drop("lp100k",axis=1, inplace=True)

df_mycars.head()

,make,mpg,cyl,disp,hp,drat,wt,qsec,vs,am,gear,carb
0,Mazda RX4,21.0,6,160.0,110,3.90,2.620,16.46,0,1,4,4
1,Mazda RX4 Wag,21.0,6,160.0,110,3.90,2.875,17.02,0,1,4,4
2,Datsun 710,22.8,4,108.0,93,3.85,2.320,18.61,1,1,4,1
3,Hornet 4 Drive,21.4,6,258.0,110,3.08,3.215,19.44,1,0,3,1
4,Hornet Sportabout,18.7,8,360.0,175,3.15,3.440,17.02,0,0,3,2

## Excercise 3

Get subset of the dataframe

In [30]:
type(df_mycars) # Dataframe

pandas.core.frame.DataFrame

In [39]:
vars = df_mycars[["make", "hp"]]
# vars = df_mycars.loc[:,["make", "hp"]] # same thing, differnet syntax
vars.head()

                make   hp
0          Mazda RX4  110
1      Mazda RX4 Wag  110
2         Datsun 710   93
3     Hornet 4 Drive  110
4  Hornet Sportabout  175

In [38]:
type(vars)

pandas.core.frame.DataFrame

## Exercise 4

Create a new subset of mycars with the make, mpg, and cyl variables

### Manipulating observations

In [41]:
# Getting the 4th element from the dataframe.
df_mycars.loc[3,] # Again, indexing in python and therefore in pandas is from 0

make    Hornet 4 Drive
mpg               21.4
cyl                  6
disp             258.0
hp                 110
drat              3.08
wt               3.215
qsec             19.44
vs                   1
am                   0
gear                 3
carb                 1
Name: 3, dtype: object

In [43]:
# Creates newmycars data structure, subset of mycars data structure with car with more than 6 cylinders

df_newmycars = df_mycars[df_mycars.cyl > 6]
df_newmycars.head()

,make,mpg,cyl,disp,hp,drat,wt,qsec,vs,am,gear,carb
4,Hornet Sportabout,18.7,8,360.0,175,3.15,3.44,17.02,0,0,3,2
6,Duster 360,14.3,8,360.0,245,3.21,3.57,15.84,0,0,3,4
11,Merc 450SE,16.4,8,275.8,180,3.07,4.07,17.40,0,0,3,3
12,Merc 450SL,17.3,8,275.8,180,3.07,3.73,17.60,0,0,3,3
13,Merc 450SLC,15.2,8,275.8,180,3.07,3.78,18.00,0,0,3,3

## Exercise 5

Get all the cars with more than 20 and less than 30 miles per gallon.

In [44]:
filter_more_20 = df_mycars.mpg > 20
filter_less_30 = df_mycars.mpg < 30

df_mycars_mpg_filered = df_mycars[filter_more_20 & filter_less_30]
df_mycars_mpg_filered.head()

,make,mpg,cyl,disp,hp,drat,wt,qsec,vs,am,gear,carb
0,Mazda RX4,21.0,6,160.0,110,3.90,2.620,16.46,0,1,4,4
1,Mazda RX4 Wag,21.0,6,160.0,110,3.90,2.875,17.02,0,1,4,4
2,Datsun 710,22.8,4,108.0,93,3.85,2.320,18.61,1,1,4,1
3,Hornet 4 Drive,21.4,6,258.0,110,3.08,3.215,19.44,1,0,3,1
7,Merc 240D,24.4,4,146.7,62,3.69,3.190,20.00,1,0,4,2